{"records":[{"id":1,"title":"Algorithms used in medicine are trained on data from only a few states","body":"Most medical algorithms are trained on data collected in New York, California, and Massachusetts. That might skew they’re accuracy if they’re used in other places, researchers suggest."},{"id":2,"title":"Discoverers of Hepatitis C Awarded the 2020 Nobel Prize in Medicine","body":"The 2020 Nobel Prize in Physiology or Medicine goes to Harvey Alter, Michael Houghton, and Charles Rice for their discovery of hepatitis C—a pathogen responsible for chronic liver diseases.Read more..."},{"id":3,"title":"Nobel Prize in Medicine Awarded to Scientists Who Discovered Hepatitis C Virus","body":"Harvey J. Alter, Michael Houghton and Charles M. Rice were jointly honored for their “decisive contribution to the fight against blood-borne hepatitis, a major global health problem.”"},{"id":4,"title":"'Amazingly irresponsible': Doctor reacts to Trump's photo-op","body":"George Washington University professor of medicine and CNN medical analyst Dr. Johnathan Reiner reacts to President Donald Trump surprising his supporters outside Walter Reed medical center where he is being treated for Covid-19."},{"id":5,"title":"Too Much Licorice Stopped Man’s Heart and Killed Him, Doctors Say","body":"A Massachusetts man’s fateful switch to licorice candy seems to have sent him to an early grave. In a case report published in the New England Journal of Medicine, doctors described how the man’s recent habit of eating a bag of licorice every day likely led t…"},{"id":6,"title":"Scientists who helped identify Hepatitis C virus win 2020 Nobel Medicine Prize - Reuters.com","body":"Scientists who helped identify Hepatitis C virus win 2020 Nobel Medicine Prize  Reuters.com"},{"id":7,"title":"Dr. Alter reflects on Nobel Medicine Prize win - Associated Press","body":"<ol><li>Dr. Alter reflects on Nobel Medicine Prize win  Associated Press\r\n</li><li>University of Alberta researcher among 3 awarded Nobel Prize in medicine for hepatitis C discovery  CBC.ca\r\n</li><li>University of Alberta virologist awarded Nobel Prize in Phy…"},{"id":8,"title":"WTO should play role in COVID-19 medicine access: candidate - Reuters India","body":"WTO should play role in COVID-19 medicine access: candidate  Reuters India"},{"id":9,"title":"University of Alberta virologist awarded Nobel Prize in Physiology or Medicine - Folio - University of Alberta","body":"<ol><li>University of Alberta virologist awarded Nobel Prize in Physiology or Medicine  Folio - University of Alberta\r\n</li><li>3 win Nobel medicine award for hepatitus C virus discovery  CBC.ca\r\n</li><li>Nobel Prize for Medicine goes to Hepatitis C discovery…"},{"id":10,"title":"Scientists win Nobel Prize in Medicine for discovery of Hepatitis C virus - CNET","body":"The Nobel Prize in Physiology or Medicine is awarded to Harvey Alter, Michael Houghton and Charles Rice."},{"id":11,"title":"Scientists who helped identify Hepatitis C virus win 2020 Nobel Medicine Prize - Reuters","body":"Two American and one British-born scientist won the 2020 Nobel Prize for Physiology or Medicine for work in identifying the Hepatitis C virus, which causes cirrhosis and liver cancer, the award-giving body said on Monday."},{"id":12,"title":"Scientists who helped identify Hepatitis C virus win 2020 Nobel Medicine Prize - Reuters","body":"Two American and one British-born scientist won the 2020 Nobel Prize for Physiology or Medicine for work in identifying the Hepatitis C virus, which causes cirrhosis and liver cancer, the award-giving body said on Monday."},{"id":13,"title":"Alberta-based scientist awarded the Nobel Prize - Global News","body":"<ol><li>Alberta-based scientist awarded the Nobel Prize  Global News\r\n</li><li>University of Alberta researcher among 3 awarded Nobel Prize in medicine for hepatitis C discovery  CBC.ca\r\n</li><li>A look as some of the Canadians who have won the Nobel Prize th…"},{"id":14,"title":"Frenchman with incurable disease to livestream his death - Reuters India","body":"A Frenchman suffering from a rare and incurable condition is livestreaming his death on social media as he refuses to take food, drink or medicine after President Emmanuel Macron turned down his request for euthanasia."},{"id":15,"title":"Frenchman with incurable disease to livestream his death - Reuters","body":"A Frenchman suffering from a rare and incurable condition is livestreaming his death on social media as he refuses to take food, drink or medicine after President Emmanuel Macron turned down his request for euthanasia."},{"id":16,"title":"Roche studies Ocrevus, experimental drug in MS as Novartis moves in - Reuters India","body":"Swiss drugmaker Roche, whose multiple sclerosis (MS) drug Ocrevus is being targeted by a rival medicine from Novartis, is advancing an experimental drug in a trial while also testing if Ocrevus works in a higher dose."},{"id":17,"title":"Frenchman with rare disease to livestream his death | Reuters Video - Reuters UK","body":"A Frenchman suffering from a rare and incurable condition is livestreaming his death on social media as he refuses to take food, drink or medicine after President Emmanuel Macron turned down his request for euthanasia. Olivia Chan reports."},{"id":18,"title":"West Ham give Leicester rude awakening, says Rodgers - Reuters UK","body":"West Ham's shock 3-0 win at Leicester City on Sunday gave the Foxes a taste of their own medicine after an equally impressive 5-2 victory at Manchester City in the previous round, manager Brendan Rodgers said."},{"id":19,"title":"Soccer-West Ham give Leicester rude awakening, says Rodgers - Reuters India","body":"West Ham's shock 3-0 win at Leicester City on Sunday gave the Foxes a taste of their own medicine after an equally impressive 5-2 victory at Manchester City in the previous round, manager Brendan Rodgers said."},{"id":20,"title":"Virus-hunting trio wins Nobel for Hepatitis C find | Reuters Video - Reuters UK","body":"Two Americans and a Briton won the 2020 Nobel Prize for Medicine on Monday (October 5) for work in identifying the Hepatitis C virus, which causes cirrhosis and liver cancer. Francis Maguire reports."},{"id":21,"title":"Roche studies Ocrevus, experimental drug in MS as Novartis moves in - Reuters","body":"Swiss drugmaker Roche, whose multiple sclerosis (MS) drug Ocrevus is being targeted by a rival medicine from Novartis, is advancing an experimental drug in a trial while also testing if Ocrevus works in a higher dose."},{"id":22,"title":"Roche says two-thirds of Evrysdi patients previously got Spinraza, Zolgensma - Reuters","body":"Swiss drugmaker Roche on Monday said two-thirds of spinal muscular atrophy (SMA) patients who have begun taking its new medicine Evrysdi have previously got rival treatments Zolgensma from Novartis or Biogen's Spinraza."},{"id":23,"title":"Frenchman with rare disease to livestream his death - Reuters India","body":"A Frenchman suffering from a rare and incurable condition is livestreaming his death on social media as he refuses to take food, drink or medicine after President Emmanuel Macron turned down his request for euthanasia. Olivia Chan reports."},{"id":24,"title":"Relief Therapeutics deal with biggest owner lifts cash to $52 mln for COVID-19 trials - Reuters","body":"Relief Therapeutics said on Monday it is getting more money from its largest stockholder to lift its cash to 48 million Swiss francs ($52 million) to fund trials of a decades-old medicine it hopes to repurpose against COVID-19."},{"id":25,"title":"RPT-Relief Therapeutics deal with biggest owner lifts cash to $52 mln for COVID-19 trials - Reuters","body":"Relief Therapeutics said on Monday it is getting more money from its largest stockholder to lift its cash to 48 million Swiss francs ($52 million) to fund trials of a decades-old medicine it hopes to repurpose against COVID-19."},{"id":26,"title":"Oxford will study top-selling prescription drug for potential COVID-19 treatment - Reuters India","body":"Oxford University said on Wednesday it would study whether the world's best-selling prescription medicine, adalimumab, was an effective treatment for COVID-19 patients, the latest effort to repurpose existing drugs as potential coronavirus therapies."},{"id":27,"title":"FDA flags health risks from 'Benadryl Challenge' - Reuters India","body":"The U.S. Food and Drug Administration on Thursday warned of serious health problems from higher consumption of the common over-the-counter allergy medicine Benadryl following a social media challenge on TikTok."},{"id":28,"title":"FDA flags health risks from 'Benadryl Challenge' - Reuters","body":"The U.S. Food and Drug Administration on Thursday warned of serious health problems from higher consumption of the common over-the-counter allergy medicine Benadryl following a social media challenge on TikTok."},{"id":29,"title":"U.S. drugmaker Merck's research chief Roger Perlmutter to retire - Reuters.com","body":"U.S. drugmaker Merck & Co Inc said on Friday its research chief Roger Perlmutter would retire at the end of the year and be succeeded by Dean Li, who heads the company's translational medicine division."},{"id":30,"title":"Virus-hunting trio wins Nobel for Hepatitis C find - Reuters","body":"Two Americans and a Briton won the 2020 Nobel Prize for Medicine on Monday (October 5) for work in identifying the Hepatitis C virus, which causes cirrhosis and liver cancer. Francis Maguire reports."},{"id":31,"title":"Coronavirus: False claims test kits for ‘Covid-19’ were sold in 2017","body":"Our latest debunk of misinformation includes claims about the World Bank, thermometers and llamas."},{"id":32,"title":"Southern Albertans named to Alberta Health Services board by minister - Medicine Hat News","body":"LETHBRIDGE HERALD Alberta Minister of Health Tyler Shandro has appointed two southern Albertans to the Alberta Health Services board, it was announced on Thursday. Dr. Sayeh Zielke, an author, business owner and physician based in Lethbridge specializing in t…"},{"id":33,"title":"Medicine Hat's active COVID-19 case count drops to four - CHAT News Today","body":"<ol><li>Medicine Hat's active COVID-19 case count drops to four  CHAT News Today\r\n</li><li>Winter escapes in Alberta amid the COVID-19 pandemic  Global News\r\n</li><li>What you need to know about COVID-19 in Alberta on Tuesday, Sept. 29  CBC.ca\r\n</li><li>'Our …"},{"id":34,"title":"3 Win Nobel Medicine Prize for Discovering Hepatitis C Virus","body":"(STOCKHOLM) — Americans Harvey J. Alter and Charles M. Rice and British-born scientist Michael Houghton won the Nobel Prize for medicine on Monday for their discovery of the hepatitis C virus, a major source of liver disease that affects millions worldwide. A…"},{"id":35,"title":"Dr Sean Conley: Physician to President Trump","body":"Dr Sean Conley has been offering updates on the president's condition. What do we know about him?"},{"id":36,"title":"Walmart to start using autonomous drones for 1-hour delivery","body":"Starting next year, certain Walmart orders will literally fly to your door. \nThe retailer announced a trial run with medical supply drone delivery company Zipline early Monday. Only medical and health and wellness products from Walmart will be part of the pil…"},{"id":37,"title":"Surgeon Simulator 2 is now free for NHS surgeons","body":"Bossa Studios, the game’s developer, is giving a free PC copy of Surgeon Simulator 2 to anyone with a valid NHS email address until October 22nd."},{"id":38,"title":"Who Is Sean Conley? White House Physician To President Trump","body":"A U.S. Navy commander, Sean Conley became Trump's doctor in 2018. He's a doctor of osteopathic medicine, and is reportedly the first non-M.D. to serve as the White House physician."},{"id":39,"title":"179 arrested in 'Operation DisrupTor' dark web drug takedown","body":"A massive international law enforcement operation has led to the arrests of 179 dark web drug traffickers who sold opioids and other illicit goods and services across Europe and the US. The investigators part of JCODE, an FBI-led multi—agency Department of Ju…"},{"id":40,"title":"Rakhmabai Raut: The child bride whose divorce Queen Victoria approved","body":"Rakhmabai Raut won a historic battle to get a divorce. But she was a pioneer in more ways than one."},{"id":41,"title":"Relief Therapeutics seeks U.S. emergency approval for drug against COVID-19 - Reuters","body":"Relief Therapeutics said on Wednesday it and U.S. partner NeuroRx asked the U.S. Food and Drug Administration for emergency approval for a drug it aims to repurpose against COVID-19, citing a 51-person study the Swiss drugmaker said showed the medicine helped…"},{"id":42,"title":"The science and medicine of human immunology","body":"The coronavirus disease 2019 (COVID-19) pandemic has underscored the critical need to better understand the human immune system and how to unleash its power to develop vaccines and therapeutics. Much of our knowledge of the immune system has accrued from stud…"},{"id":43,"title":"FDA tells Novartis to gather more data on Zolgensma in older patients - Reuters","body":"Novartis will do a new study of its $2.1 million-per-patient gene therapy Zolgensma on older spinal muscular atrophy patients getting the medicine via a spinal infusion, the Swiss drugmaker said on Wednesday, after the U.S. Food and Drug Administration said i…"},{"id":44,"title":"“Taking” lessons","body":"What an accurate and horrible term. It’s hard to imagine that most people would look forward to taking lessons. In the piano or arithmetic or anything else. You take medicine. You take your punishment. It’s unwanted but grudgingly accepted. The term gives awa…"},{"id":45,"title":"How Early Modern Empire Changed Medicine","body":"Global trade, enslaved labor, and colonial warfare created demands for medicines that would work for anyone, anywhere. That pressure to view patients as interchangeable remains with us today."},{"id":46,"title":"My patients suffered because of Michigan Gov. Gretchen Whitmer's illegal lockdown","body":"In Michigan, the ban on supposedly non-essential medical care shows a shocking ignorance of how medicine works. I'm suing because this can't stand."},{"id":47,"title":"All the president’s medicine: How doctors are treating Trump","body":"Doctors have come up with a “multi-pronged approach” to cure President Donald Trump of the coronavirus."},{"id":48,"title":"A Relationship Built on Resiliency","body":"Dr. Lisa Jacobs fell in love with Mark Kerstens’s sense of adventure, which took them from San Francisco to Amsterdam and back again."},{"id":49,"title":"Dr. Rebecca Shadowen, Expert in Infectious Diseases, Dies at 62","body":"Dr. Shadowen, ill with the coronavirus, continued to attend working group meetings. She eventually died of Covid-19."},{"id":50,"title":"Adtalem Global to buy Walden University for $1.48 billion - Reuters","body":"For-profit school chain Adtalem Global Education Inc <ATGE.N> said on Friday it plans to buy Walden University from Laureate Education Inc <LAUR.O> for $1.48 billion in cash to expand its reach into healthcare education."},{"id":51,"title":"Chinese researchers develop neural system for brain-machine interface • Canindia News - CanIndia News","body":"Beijing, Sep 21 (IANS) Chinese researchers have developed a neural signal analysis system with memristor arrays, paving the way for high-efficiency brain-machine interfaces. Brain-machine interfaces are promising tools for rehabilitation medicine and medical …"},{"id":52,"title":"Hurricane Laura's impact lingered with nightmarish mosquito swarms","body":"After Hurricane Laura hit land in the southern United States in late August and devastated the Louisiana coast, the storm surges and rainfall it brought along flooded the region.\nThat flooded environment was an ideal breeding ground for some types of mosquito…"},{"id":53,"title":"Obesity, diabetes raise Covid-19 death risk - Hindustan Times","body":"Morbid obesity, diabetes and hypertension were the most common risk factors in young adults, with those having more than one of these conditions facing risks comparable to older adults having no pre-existing illnesses, reported a study published in JAMA Inter…"},{"id":54,"title":"The Nobel Prize in Physiology or Medicine 2020","body":"The Nobel Prize in Physiology or Medicine 2020 was awarded jointly to Harvey J. Alter, Michael Houghton and Charles M. Rice \"for the discovery of Hepatitis C virus\"."},{"id":55,"title":"Man dies from eating more than a bag of liquorice a day","body":"The 54-year-old construction worker ate a bag-and-a-half of black liquorice every day, doctors say."},{"id":56,"title":"Man dies from overdose of black licorice","body":"A 54-year-old man in Massachusetts died from eating too much black licorice, reports a cardiologist in the New England Journal of Medicine. Apparently the deceased at a bag and a half every few weeks.\n\n\n\n\"Even a small amount of licorice you eat can increase y…"},{"id":57,"title":"Americans need to 'hunker down' this fall and winter as Covid-19 pandemic will likely worsen, Fauci says","body":"Nearly 30 US states are reporting downward trends in Covid-19 cases, but the pandemic will likely worsen again, according to the country's leading infectious disease expert."},{"id":58,"title":"Reuters to host Twitter chat on managing mental health in a pandemic - Reuters","body":"Today, Reuters will host a Twitter chat to discuss strategies to help protect mental health during the coronavirus pandemic, featuring mental health experts from the American Psychiatric Association, Harvard T.H. Chan School of Public Health, University of Mi…"},{"id":59,"title":"Nobel Prize for Medicine awarded to trio who discovered Hepatitis C virus","body":"Three scientists have been announced as the winners of the 2020 Nobel Prize in Physiology or Medicine “for the discovery of Hepatitis C virus.”"},{"id":60,"title":"Hockey Needs Viewers. It Should Not Glorify Pain and Violence to Get Them.","body":"A promotional video posted by the N.H.L. that glorified pain showed a disturbing embrace of violence by the league. The post has since been deleted."},{"id":61,"title":"In-vest-ing in Menopause","body":"Most of us reach for an over-the-counter medicine if we have occasional pain, but menopause doesn’t act like that. Hot flashes don’t build like a headache, dizzy spells don’t wait for a good time, and panic attacks don’t announce themselves. Predicting and ad…"},{"id":62,"title":"Cousteau’s Proteus Will Be the ISS of the Seas","body":"The Earth’s oceans are a vast frontier that brims with possibilities for the future of medicine, ocean conservation, and food production. They remain largely unexplored because of the physical limits of scuba diving. Humans can only dive for a few hours each …"},{"id":63,"title":"Russia reports 8,481 new coronavirus cases, 177 deaths - Reuters UK","body":"Russia on Wednesday reported 8,481 new coronavirus cases in the last 24 hours, pushing the nationwide tally to 1,176,286."},{"id":64,"title":"Discovery of Hepatitis C Snags Nobel Prize in Medicine","body":"Harvey Alter, Michael Houghton and Charles Rice share the award for identifying the virus behind the blood-borne liver disease\n\n-- Read more on ScientificAmerican.com"},{"id":65,"title":"Discovery of Hepatitis C Snags Nobel Prize in Medicine","body":"Harvey Alter, Michael Houghton and Charles Rice share the award for identifying the virus behind the bloodborne liver disease\n\n-- Read more on ScientificAmerican.com"},{"id":66,"title":"Nine in ten recovered COVID-19 patients experience side-effects, study shows - Reuters UK","body":"Nine in ten coronavirus patients reported experiencing side-effects such as fatigue, psychological after-effects and loss of smell and taste after they recovered from the disease, according to a preliminary study by South Korea."},{"id":67,"title":"Laughter: The Best Medicine","body":"If you listen closely to giggles, guffaws, and polite chuckles, you can discern a huge amount of information about people and their relationships with each other. This week, we talk with neuroscientist Sophie Scott about the many shades of laughter, from cack…"},{"id":68,"title":"How to Use Artificial Intelligence in Mobile Apps","body":"Artificial intelligence is one of the biggest trends in the app development industry. AI is slowly pouring into every routine activity of ours whether it’s education, production, medicine, or economics through mobile apps. Here is how to use artificial intell…"},{"id":69,"title":"Russia's coronavirus death toll passes 19,000 - Reuters UK","body":"Russia's death toll from the novel coronavirus passed 19,000 on Thursday, as the country reported 144 new deaths in the previous 24 hours."},{"id":70,"title":"Russia's coronavirus death toll passes 19,000 - Reuters India","body":"Russia's death toll from the novel coronavirus passed 19,000 on Thursday, as the country reported 144 new deaths in the previous 24 hours."},{"id":71,"title":"Russia reports 6,431 new coronavirus cases, 150 deaths - Reuters UK","body":"Russia on Wednesday reported 6,431 new coronavirus cases in the last 24 hours, its highest daily increase since July 13."},{"id":72,"title":"Russia's coronavirus death toll passes 19,000 - Reuters UK","body":"Russia's death toll from the novel coronavirus passed 19,000 on Thursday, as the country reported 144 new deaths in the previous 24 hours."},{"id":73,"title":"Robots to be used in UK care homes to help reduce loneliness","body":"Machines can hold simple conversations and have been found to improve mental healthRobots that can hold simple conversations and learn people’s interests are to be deployed in some UK care homes after an international trial found they boosted mental health an…"},{"id":74,"title":"Man dies after eating bag of licorice every day for a few weeks","body":"A Massachusetts construction worker’s love of black licorice wound up costing him his life, doctors sayA Massachusetts construction worker’s love of black licorice wound up costing him his life. Eating a bag and a half every day for a few weeks threw his nutr…"},{"id":75,"title":"SIGN UP NOW TO TUNE IN ON OCTOBER 5: Hear the latest on the race for a coronavirus vaccine and the 'return to normal' from 3 leading experts","body":"Summary List Placement\n\nCoronavirus vaccines have progressed extraordinarily quickly in reaching the final stages of clinical testing, supporting the possibility that hundreds of millions of doses could be administered in 2021. \nA vaccine is widely acknowledg…"},{"id":76,"title":"A Ransomware Attack Has Struck a Major US Hospital Chain","body":"“All computers are completely shut down,” one United Health Services employee told WIRED."},{"id":77,"title":"Arlan Hamilton and Katie Rae Say Tech Can Do Well—and Do Good","body":"At the WIRED25 event, the two investors say traditional venture capital misses opportunities because it is a monoculture."},{"id":78,"title":"Regeneron's antibody drug added to UK Recovery trial of COVID treatments - Reuters UK","body":"The world's largest randomised trial of potential medicines for COVID-19 is to add Regeneron's <REGN.O> experimental antiviral antibody cocktail REGN-COV2 to the drugs it is testing in patients hospitalised with the disease."},{"id":79,"title":"Regeneron's antibody drug added to UK Recovery trial of COVID treatments - Reuters India","body":"The world's largest randomised trial of potential medicines for COVID-19 is to add Regeneron's experimental antiviral antibody cocktail REGN-COV2 to the drugs it is testing in patients hospitalised with the disease."},{"id":80,"title":"Covid-19: China's dilemma over wild meat trade","body":"Breeding snakes and types of rat for food or medicine is a source of income for some of China's poorest people."},{"id":81,"title":"Fourth patient dies as Foothills hospital outbreaks continue to grow - Calgary Herald","body":"<ol><li>Fourth patient dies as Foothills hospital outbreaks continue to grow  Calgary Herald\r\n</li><li>COVID-19 causing stress, depression and obsessive behaviour: survey  CTV News\r\n</li><li>Buying Houses In Calgary & Edmonton Is Going To Get So Cheap Because…"},{"id":82,"title":"No Evidence That Hydroxychloroquine Can Prevent Covid-19, Concludes New Study","body":"A new study is the latest to suggest that hydroxychloroquine isn’t an effective weapon against covid-19, even when taken as a preventative drug. The randomized, double-blinded trial found no difference in the risk of catching covid-19 among health care worker…"},{"id":83,"title":"85 Million Pieces of Mail Delayed in One Week Thanks to Louis DeJoy, Senate Report Says","body":"Controversial changes ordered by Postmaster General Louis DeJoy caused an estimated 85 million more packages to arrive late in one week and, in some districts, nearly a 20 percent drop in on-time deliveries, a new Senate report finds. Read more..."},{"id":84,"title":"So, Who Else Thinks the White House Is Totally Pulling a Weekend at Bernie’s?","body":"President Donald Trump is fine. Everything’s fine. Pay no attention to that man behind the curtain.Read more..."},{"id":85,"title":"Peace Corps Faces Questions Over Another Volunteer Death","body":"A 24-year-old volunteer died of undiagnosed malaria on the island nation of Comoros. It was one of at least three deaths since 2009 that have been linked to mistakes by Peace Corps doctors."},{"id":86,"title":"Immigrants Keep Sending Money Home Despite Pandemic Job Losses","body":"Remittances, a lifeline for many families around the world, have rebounded after a decline during the early months of the crisis, defying projections."},{"id":87,"title":"Instead of Reassurance, Trump’s Doctor Delivers Confusion, Experts Say","body":"Dr. Sean P. Conley, who admitted that he had misled the public about the president’s treatment, has lost credibility with some colleagues."},{"id":88,"title":"Experts Warn a Rare Pediatric Condition May Re-emerge This Fall","body":"There’s no cure for acute flaccid myelitis, or A.F.M., but early detection is key for better outcomes."},{"id":89,"title":"Dentist Who Pulled Tooth While Riding Hoverboard Sentenced to 12 Years in Prison","body":"The hoverboard is the cursed gadget that keeps on giving. Years after the devices became infamous for exploding, they’re back in the news. This week, Seth Lookhart, a former dentist in Anchorage, Alaska, was sentenced to 12 years in jail after a video of him …"},{"id":90,"title":"‘Just a Small Play Date’? You Still Need to Be Careful","body":"Experts warn that seemingly harmless interactions with close family and friends may be driving the spread of Covid."},{"id":91,"title":"The Untraveled High Road of Humility, and a President Laid Low","body":"As President Trump remained hospitalized, the situation was an example of why politicians are advised to be humble, or act humble, if they can possibly stand it."},{"id":92,"title":"Your Smartphone Can Tell If You’re Drunk-Walking","body":"In a recent study, scientists could tell if people were intoxicated just by looking at their phones’ motion data."},{"id":93,"title":"Could a Century-Old TB Shot Protect Against Other Respiratory Diseases?","body":"A trial in Greece shows a long-used tuberculosis vaccine may cut respiratory infections, raising hopes for similar protection against Covid-19."},{"id":94,"title":"Health tech pins hope on Africa's pandemic shift to online care - Reuters Canada","body":"When Loveth Metiboba's baby had diarrhoea, she worried that taking him to a clinic near her home in Nigeria's capital, Abuja, might expose them both to the coronavirus."},{"id":95,"title":"Turkey's Erdogan says COVID-19 vaccine must be for everyone - Reuters","body":"Turkey's President Tayyip Erdogan said in an address to the United Nations on Tuesday any future COVID-19 vaccine should be universally available, regardless of where it is produced."},{"id":96,"title":"Indigenous activists occupy Petroperu pipeline facilities over healthcare demands - Reuters India","body":"More than 100 indigenous activists in Peru´s Amazon occupied infrastructure belonging to the state-run Petroperú pipeline, the company said on Tuesday, demanding improved social benefits and health care in the face of the coronavirus pandemic."},{"id":97,"title":"Health tech pins hope on Africa's pandemic shift to online care - Reuters Africa","body":"When Loveth Metiboba's baby had diarrhoea, she worried that taking him to a clinic near her home in Nigeria's capital, Abuja, might expose them both to the coronavirus."},{"id":98,"title":"Indigenous activists occupy Petroperu pipeline facilities over healthcare demands - Reuters","body":"More than 100 indigenous activists in Peru´s Amazon occupied infrastructure belonging to the state-run Petroperú pipeline, the company said on Tuesday, demanding improved social benefits and health care in the face of the coronavirus pandemic."},{"id":99,"title":"Vaccine Maker Novavax Enters Final Large-Scale Testing of Its Covid-19 Vaccine","body":"The New York Times reports:\nVaccine maker Novavax said Thursday that it would begin the final stages of testing its coronavirus vaccine in the United Kingdom and that another large trial was scheduled to begin next month in the United States. It is the fifth …"},{"id":100,"title":"Alberta sees 171 new COVID cases but only three in South Zone - Lethbridge News Now","body":"LETHBRIDGE, AB. - Alberta Health Services has released Wednesday's report on COVID-19, detailing the numbers o..."}]}